In [1]:
# database:- MYsql, sql server, sqlite

In [2]:
pip install PyMySQL

Defaulting to user installation because normal site-packages is not writeable
Collecting PyMySQL
  Downloading pymysql-1.1.2-py3-none-any.whl.metadata (4.3 kB)
Downloading pymysql-1.1.2-py3-none-any.whl (45 kB)
Installing collected packages: PyMySQL
Successfully installed PyMySQL-1.1.2
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pymysql as py
print('done')

done

In [4]:
conn = py.connect(user = 'root',host='localhost',password='Ayush@1013', autocommit=True)
print('connect')

connect

In [5]:
cur = conn.cursor()
print('done')

done

In [6]:
query = """ show databases;"""
cur.execute(query)

10

In [29]:
result = cur.fetchall()

In [30]:
len(result)

9

In [11]:
# single element ka tuple akela nho ban skta hai isliye comma lagana pdta hai

In [31]:
for index, database in enumerate(result):
    print(index+1,database[0])

1 ayushdb
2 ecommerce
3 information_schema
4 mysql
5 payments
6 performance_schema
7 sys
8 tcs
9 world

In [43]:
query = """select * from payments.payments;"""
cur.execute(query)
print('donr')

donr

In [44]:
result = cur.fetchall()

In [8]:
for each_row in result:
    print(each_row)
    print("--------------------------------------",end='\n'*3)

NameError: name 'result' is not defined

In [68]:
all_columns = []
for i in cur.description:
    all_columns.append(i[0])

print(all_columns)

AttributeError: 'bool' object has no attribute 'description'

In [49]:
import pandas as pd

In [52]:
df = pd.DataFrame(result,columns = all_columns)
df

,order_id,payment_sequential,payment_type,payment_installments,payment_value
0,b81ef226f3fe1789b1e8b2acac839d17,1,credit_card,8,99.33
1,a9810da82917af2d9aefd1278f1dcfa0,1,credit_card,1,24.39
2,25e8ea4e93396b6fa0d3dd708e76c1bd,1,credit_card,1,65.71
3,ba78997921bbcdc1373bb41e913ab953,1,credit_card,8,107.78
4,42fdf880ba16b47b59251dd489d4441a,1,credit_card,2,128.45
...,...,...,...,...,...
4680,709aa9888718ec2b9b285f55fbf0c528,1,credit_card,5,69.70
4681,891aa648b48d27ce10d74e86d312d411,1,credit_card,2,101.24
4682,4b42a606687e048a7a33669b84bf8690,1,credit_card,3,145.18
4683,51c064ec2d79d398b30db3f8e1de8ec8,1,UPI,1,38.63
4684,e8253edb8afd8c06fed540435eac942d,1,UPI,1,60.31

In [53]:
df.head()

,order_id,payment_sequential,payment_type,payment_installments,payment_value
0,b81ef226f3fe1789b1e8b2acac839d17,1,credit_card,8,99.33
1,a9810da82917af2d9aefd1278f1dcfa0,1,credit_card,1,24.39
2,25e8ea4e93396b6fa0d3dd708e76c1bd,1,credit_card,1,65.71
3,ba78997921bbcdc1373bb41e913ab953,1,credit_card,8,107.78
4,42fdf880ba16b47b59251dd489d4441a,1,credit_card,2,128.45

In [54]:
df.tail()

,order_id,payment_sequential,payment_type,payment_installments,payment_value
4680,709aa9888718ec2b9b285f55fbf0c528,1,credit_card,5,69.70
4681,891aa648b48d27ce10d74e86d312d411,1,credit_card,2,101.24
4682,4b42a606687e048a7a33669b84bf8690,1,credit_card,3,145.18
4683,51c064ec2d79d398b30db3f8e1de8ec8,1,UPI,1,38.63
4684,e8253edb8afd8c06fed540435eac942d,1,UPI,1,60.31

In [56]:
df.sample()

,order_id,payment_sequential,payment_type,payment_installments,payment_value
2391,8ee667e6f4ac4034b939b09c26f1ce2e,1,credit_card,2,87.15

In [9]:
def make_connection():
    try:
        conn = py.connect(user = 'root', host='localhost',password='1401',autocommit = True)
        cur = conn.cursor()
        return cur
    except:
        return False

In [10]:
cur = make_connection()

In [11]:
def execute_query(query):
    try:
        cur.execute(query)
        result = cur.fetchall()
        if len(result)>0:
            all_columns = []
            for i in cur.description:
                all_columns.append(i[0])
            df = pd.DataFrame(result,columns = all_columns)
            return df
        else:
            return'query executed '
    except Exception as e:
        print(e)

In [66]:
execute_query('select * from payments.payments;')

'bool' object has no attribute 'execute'

In [67]:
conn.close()

In [12]:
cur = make_connection()
if not cur:
    print('connection failed!')

else:
    print('connection established!')

connection failed!

# day 2

In [12]:
q = '''create database python_mysql;'''

execute_query(q)

'bool' object has no attribute 'execute'

In [16]:
q= '''create table python_to_mysql.mysql_table
(roll_no int,
class int,
full_name varchar(20),
phone varchar(20));'''

execute_query(q)

'bool' object has no attribute 'execute'

In [17]:
import random
full_name = ['ayush','ravi','ajay','mohan','vipin','kaushal','gaurav']
for i in  range(10):
   classs = random.randint(1,12)
   name = random.choice(full_name)
   phone = random.randint(7928934321,9999999999)
   values = (i+1,classs,name,phone)
   q = f'''insert into python_to_mysql.mysql_table valiues{values}'''
   execute_query(q)

'bool' object has no attribute 'execute'
'bool' object has no attribute 'execute'
'bool' object has no attribute 'execute'
'bool' object has no attribute 'execute'
'bool' object has no attribute 'execute'
'bool' object has no attribute 'execute'
'bool' object has no attribute 'execute'
'bool' object has no attribute 'execute'
'bool' object has no attribute 'execute'
'bool' object has no attribute 'execute'

In [18]:
q= '''update python_to_mysql.mysql_table set full_name = "Drish"
where roll_no = 8;'''
execute_query(q)

'bool' object has no attribute 'execute'

'bool' object has no attribute 'execute'

TypeError: 'NoneType' object is not subscriptable

In [20]:
q = '''select max(roll_no) from python_to_mysql.mysql_table;'''
execute_query(q)['max(roll_no)'][0]+

'bool' object has no attribute 'execute'

TypeError: 'NoneType' object is not subscriptable

In [ ]:
name = input('Enter your name')
classs = int(input('Enter your class: '))
phone = input('Enter your phone number n')